In [1]:
import pandas as pd

In [4]:
s = pd.Series([34,4,42,34,45])

In [5]:
type(s)

pandas.core.series.Series

In [6]:
print(s)

0    34
1     4
2    42
3    34
4    45
dtype: int64

In [8]:
s2 =pd.Series([33,34,2,3,44,42,32], index=["om","yash","rosh","ram","nan","chottu","ishaN"])

In [9]:
s2

om        33
yash      34
rosh       2
ram        3
nan       44
chottu    42
ishaN     32
dtype: int64

In [13]:
s2["om"]

33

In [14]:
data = {
    "name": ["Alice", "Bob", "Charlie"],
    "age": [25, 30, 35],
    "city": ["Delhi", "Mumbai", "Bangalore"]
}

df = pd.DataFrame(data)
print(df)

      name  age       city
0    Alice   25      Delhi
1      Bob   30     Mumbai
2  Charlie   35  Bangalore

In [15]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [17]:
df.columns

Index(['name', 'age', 'city'], dtype='object')

In [5]:

data = [
    ["Alice", 25],
    ["Bob", 30],
    ["Charlie", 35]
]

df = pd.DataFrame(data, columns=["Name", "Age"])
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [9]:
data ={"a":[4,4,3],"b":[3,3,23]}
df=pd.DataFrame(data)

In [3]:
df.head()

NameError: name 'df' is not defined

In [15]:
df = pd.read_excel("data.xlsx")

In [16]:
df

      name school  marks
0     yash     cs    2.0
1  saksshi      j    6.0
2       om     xx    8.0
3       ds    x s   10.0
4       dd      j   13.0
5      ccs     s    15.6
6      ccs     s    18.2
7    ccccs      d   20.8

In [17]:
df=pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")

In [18]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [2]:
df.head()

NameError: name 'df' is not defined

In [20]:
df.tail()

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [1]:
df.head(5)

NameError: name 'df' is not defined